---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.RuleType
source: html/d6257806-a101-d1db-0745-15735a67e23a.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.RuleType Property

The rule type for this demand factor definition.

## Syntax (C#)
```csharp
public ElectricalDemandFactorRule RuleType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration